app/Http/Controllers/Api/User/AddMoneyController.php

select * from `basic_settings` limit 1
select * from `payment_gateway_currencies` where `alias` = 'jazzcash-pkr-manual' and exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'add-money' and `status` = 1) limit 1
---
    public function submitData(Request $request) {

         $validator = Validator::make($request->all(), [
            'currency'  => "required",
            'amount'        => "required|numeric",
            'sender_wallet'  =>'required',
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                $error = ['error'=>['Please submit kyc information!']];
                return Helpers::error($error);
            }elseif($user->kyc_verified == 2){
                $error = ['error'=>['Please wait before admin approved your kyc information']];
                return Helpers::error($error);
            }elseif($user->kyc_verified == 3){
                $error = ['error'=>['Admin rejected your kyc information, Please re-submit again']];
                return Helpers::error($error);
            }
        }
        $alias = $request->currency;
        $amount = $request->amount;
        $payment_gateways_currencies = PaymentGatewayCurrency::where('alias',$alias)->whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::add_money_slug());
            $gateway->where('status', 1);
             })->first();

select * from `currencies` where `currencies`.`id` in (2)
select * from `user_wallets` where `user_id` = 1 and `id` = '2' limit 1
---
        }
        $defualt_currency = Currency::default();

        $user_wallet = UserWallet::auth()->with(['currency'])->where('id', $request->sender_wallet)->first();

select * from `temporary_datas` where `identifier` = 'qUca3uYvByNQm5eh' limit 1
---
            $instance = PaymentGatewayApi::init($request->all())->gateway()->api()->get();

            $trx = $instance['response']['id']??$instance['response']['trx']??$instance['response']['reference_id']??$instance['response'];
            $temData = TemporaryData::where('identifier',$trx)->first();

select * from `payment_gateway_currencies` where `id` = 7 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (18) order by `id` desc
select * from `payment_gateways` where `id` = 18 limit 1
---
                $error = ['error'=>["Invalid Request"]];
                return Helpers::error($error);
            }
            $payment_gateway_currency = PaymentGatewayCurrency::where('id', $temData->data->currency)->first();
            $payment_gateway = PaymentGateway::where('id', $temData->data->gateway)->first();