app/Http/Controllers/Api/User/MakePaymentController.php

    public function makePaymentInfo(){
        $user = auth()->user();
        $makePaymentcharge = TransactionSetting::where('slug','make-payment')->where('status',1)->get()->map(function($data){
            return[
                'id' => $data->id,
                'slug' => $data->slug,
                'title' => $data->title,
                'fixed_charge' => getAmount($data->fixed_charge,2),
                'percent_charge' => getAmount($data->percent_charge,2),
                'min_limit' => getAmount($data->min_limit,2),
                'max_limit' => getAmount($data->max_limit,2),
            ];
        })->first();
        $transactions = Transaction::auth()->makePayment()->latest()->take(10)->get()->map(function($item){
            $statusInfo = [
                "success" =>      1,
                "pending" =>      2,
                "rejected" =>     3,
                ];
                if($item->attribute == payment_gateway_const()::SEND){
                    return[
                        'id' => @$item->id,
                        'type' =>$item->attribute,
                        'trx' => @$item->trx_id,
                        'transaction_type' => $item->type,
                        'transaction_heading' => "Make Payment to @" . @$item->details->receiver->username." (".@$item->details->receiver->email.")",
                        'request_amount' => getAmount(@$item->request_amount,2),
                        'total_charge' => getAmount(@$item->charge->total_charge,2),
                        'payable' => getAmount(@$item->payable,2),
                        'recipient_received' => getAmount(@$item->details->recipient_amount,2),
                        'current_balance' => getAmount(@$item->available_balance,2),
                        'status' => @$item->stringStatus->value ,
                        'date_time' => @$item->created_at ,
                        'status_info' =>(object)@$statusInfo ,
---
select * from `transaction_settings` where `slug` = 'make-payment' and `status` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'MAKE-PAYMENT' order by `created_at` desc limit 10

                }

        });
        $userWallet = UserWallet::where('user_id',$user->id)->get()->map(function($data){
            return[
                'balance' => getAmount($data->balance,2),
                'currency' => $data->currency->code,
            ];
        });
---
select * from `currencies` where `currencies`.`id` = 1 limit 1
select * from `user_wallets` where `user_id` = 1