app/Http/Controllers/Api/User/UserController.php

select * from `virtual_card_apis` limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::first();

select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'RECEIVED'
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'SEND'
select sum(`amount`) as aggregate from `virtual_cards` where `user_id` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'BILL-PAY'
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MOBILE-TOPUP'
select count(*) as aggregate from `transactions` where `user_id` = 1 and `status` = 1
select * from `currencies` where `currencies`.`id` = 1 limit 1
select * from `user_wallets` where `user_id` = 1
select * from `currencies` where `sender` = 1 and `status` = 1
select * from `currencies` where `receiver` = 1 and `status` = 1
select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 5
select * from `basic_settings` limit 1
---
    public function home(){
        $user = auth()->user();
        $totalAddMoney = Transaction::auth()->addMoney()->where('status',1)->sum('request_amount');
        $totalReceiveRemittance =Transaction::auth()->remitance()->where('attribute',"RECEIVED")->sum('request_amount');
        $totalSendRemittance =Transaction::auth()->remitance()->where('attribute',"SEND")->sum('request_amount');
        $cardAmount =VirtualCard::where('user_id',auth()->user()->id)->sum('amount');
        $billPay = Transaction::auth()->billPay()->sum('request_amount');
        $topUps = Transaction::auth()->mobileTopup()->sum('request_amount');
        $totalTransactions =Transaction::auth()->where('status', 1)->count();

        $userWallet = UserWallet::where('user_id',$user->id)->get()->map(function($data){
            return[
                'balance' => getAmount($data->balance,2),
                'currency' => $data->currency->code,
            ];
        });

        $sender_currency    = Currency::where('sender',true)->where('status',true)->get()->map(function($data){
            return[
                'name'      => $data->name,
                'code'      => $data->code,
                'type'      => $data->type,
                'rate'      => $data->rate,
                'symbol'    => $data->symbol,
            ];
        });

        $receiver_currency    = Currency::where('receiver',true)->where('status',true)->get()->map(function($data){
            return[
                'name'      => $data->name,
                'code'      => $data->code,
                'type'      => $data->type,
                'rate'      => $data->rate,
                'symbol'    => $data->symbol,
            ];
        });

        $transactions = Transaction::auth()->latest()->take(5)->get()->map(function($item){

            $basic_settings = BasicSettings::first();
            if($item->type == payment_gateway_const()::TYPEADDMONEY){
                return[
                    'id' => $item->id,
                    'type' =>$item->attribute,
                    'trx' => $item->trx_id,
                    'transaction_type' => $item->type,
                    'request_amount' => getAmount($item->request_amount,2).' '.get_default_currency_code() ,
                    'payable' => getAmount($item->payable,2).' '.$item->currency->currency_code,
                    'status' => $item->stringStatus->value ,
                    'remark' => $item->remark??"",
                    'date_time' => $item->created_at ,

                ];
            }elseif($item->type == payment_gateway_const()::BILLPAY){
                return[
                    'id' => $item->id,
                    'type' =>$item->attribute,
                    'trx' => $item->trx_id,