app/Http/Controllers/Api/User/WithdrawController.php

    public function moneyOutInfo(){
        $user = auth()->user();
        $userWallet = UserWallet::where('user_id',$user->id)->get()->map(function($data){
            return[
                'balance' => getAmount($data->balance,2),
                'currency' => $data->currency->code,
            ];
        });

        $currency    = Currency::where('status',true)->get()->map(function($data){
            return[
                'name'      => $data->name,
                'code'      => $data->code,
                'type'      => $data->type,
                'rate'      => $data->rate,
                'symbol'    => $data->symbol,
            ];
        });

        $transactions = Transaction::auth()->withdraw()->latest()->take(5)->get()->map(function($item){
                $statusInfo = [
                    "success" =>      1,
                    "pending" =>      2,
                    "rejected" =>     3,
                    ];
                return[
                    'id' => $item->id,
                    'trx' => $item->trx_id,
                    'gateway_name' => $item->currency->gateway->name,
                    'gateway_currency_name' => $item->currency->name,
                    'transaction_type' => $item->type,
                    'request_amount' => getAmount($item->request_amount,2).' '.get_default_currency_code() ,
                    'payable' => getAmount($item->payable,2).' '.$item->currency->currency_code,
                    'exchange_rate' => '1 ' .get_default_currency_code().' = '.getAmount($item->currency->rate,2).' '.$item->currency->currency_code,
                    'total_charge' => getAmount($item->charge->total_charge,2).' '.$item->currency->currency_code,
                    'current_balance' => getAmount($item->available_balance,2).' '.get_default_currency_code(),
                    'status' => $item->stringStatus->value ,
                    'date_time' => $item->created_at ,
                    'status_info' =>(object)$statusInfo ,
                    'rejection_reason' =>$item->reject_reason??"" ,

                ];
        });
        $gateways = PaymentGateway::where('status', 1)->where('slug', PaymentGatewayConst::money_out_slug())->get()->map(function($gateway){
                $currencies = PaymentGatewayCurrency::where('payment_gateway_id',$gateway->id)->get()->map(function($data){
                return[
                    'id' => $data->id,
                    'payment_gateway_id' => $data->payment_gateway_id,
                    'type' => $data->gateway->type,
                    'name' => $data->name,
                    'alias' => $data->alias,
                    'currency_code' => $data->currency_code,
                    'currency_symbol' => $data->currency_symbol,
                    'image' => $data->image,
                    'min_limit' => getAmount($data->min_limit,2),
                    'max_limit' => getAmount($data->max_limit,2),
                    'percent_charge' => getAmount($data->percent_charge,2),
                    'fixed_charge' => getAmount($data->fixed_charge,2),
                    'rate' => getAmount($data->rate,2),
                    'created_at' => $data->created_at,
                    'updated_at' => $data->updated_at,
                ];

                });
---
select * from `currencies` where `currencies`.`id` = 1 limit 1
select * from `user_wallets` where `user_id` = 1
select * from `currencies` where `status` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'WITHDRAW' order by `created_at` desc limit 5
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (17) order by `id` desc
select * from `payment_gateways` where `status` = 1 and `slug` = 'money-out'
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (17, 23, 24, 25, 26, 27) order by `id` desc