app/Http/Controllers/User/AddMoneyController.php

select * from `user_wallets` where `user_id` = 1
select * from `user_wallets` where `user_id` = 1 and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `status` = 1) and `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'add-money' and `status` = 1)
select * from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' order by `created_at` desc limit 10
---
    public function index() {

        $page_title         = "Add Money";
        $user_wallets       = UserWallet::auth()->get();
        $user_currencies    = UserWallet::auth()->whereHas('currency',function($q) {
            $q->where("status",GlobalConst::ACTIVE);
        })->active()->get();
        $payment_gateways_currencies = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::add_money_slug());
            $gateway->where('status', 1);
        })->get();
        $transactions = Transaction::auth()->addMoney()->latest()->take(10)->get();

select * from `basic_settings` limit 1
---
    public function submit(Request $request) {
        $basic_setting = BasicSettings::first();

select * from `temporary_datas` where `type` = 'paypal' and `identifier` = '1MJ35637TP982581L' limit 1
---
    public function success(Request $request, $gateway){
        $requestData = $request->all();
        $token = $requestData['token'] ?? "";
        $checkTempData = TemporaryData::where("type",$gateway)->where("identifier",$token)->first();
        if(!$checkTempData) return redirect()->route('user.add.money.index')->with(['error' => ['Transaction Failed. Record didn\'t saved properly. Please try again.']]);

select * from `temporary_datas` where `identifier` = 'yeDRJZAWD9X9vnJh' limit 1
select * from `payment_gateways` where (`type` = 'MANUAL') and `slug` = 'add-money' and `id` = 18 limit 1
---
    public function manualPayment(){
        $tempData = Session::get('identifier');
        $hasData = TemporaryData::where('identifier', $tempData)->first();
        $gateway = PaymentGateway::manual()->where('slug',PaymentGatewayConst::add_money_slug())->where('id',$hasData->data->gateway)->first();