app/Http/Controllers/User/BillPayController.php

    public function index() {
        $page_title = "Bill Pay";
        $sender_wallets = UserWallet::auth()->whereHas('currency',function($q) {
            $q->where("sender",GlobalConst::ACTIVE)->where("status",GlobalConst::ACTIVE);
        })->active()->get();
        $charges = TransactionSetting::where('slug','bill_pay')->where('status',1)->first();
        $bill_types = BillPayCategory::active()->get();
        $transactions = Transaction::auth()->billPay()->latest()->take(10)->get();
---
select * from `user_wallets` where `user_id` = 1 and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `sender` = 1 and `status` = 1) and `status` = 1
select * from `transaction_settings` where `slug` = 'bill_pay' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'BILL-PAY' order by `created_at` desc limit 10