app/Http/Controllers/User/DashboardController.php

select * from `currencies` where `currencies`.`id` in (1, 2)
select * from `user_wallets` where `user_id` = 5 and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `type` = 'FIAT') order by `balance` desc limit 8
select * from `users` where `users`.`id` in (5)
select * from `currencies` where `currencies`.`id` in (3)
select * from `user_wallets` where `user_id` = 5 and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `type` = 'CRYPTO') order by `balance` desc limit 8
select * from `transactions` where `user_id` = 5 order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 5 and `type` = 'REMITTANCE' and `attribute` = 'RECEIVED' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 5 and `type` = 'REMITTANCE' and `attribute` = 'SEND' and `status` = 1
select sum(`amount`) as aggregate from `virtual_cards` where `user_id` = 5
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 5 and `type` = 'BILL-PAY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 5 and `type` = 'MOBILE-TOPUP' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 5 and `type` = 'MONEY-OUT' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 5 and `status` = 1
---
    public function index()
    {
        $page_title = "Dashboard";
        $baseCurrency = Currency::default();
        $fiat_wallets = UserWallet::auth()->whereHas("currency",function($q) {
            return $q->where("type",GlobalConst::FIAT);
        })->with('currency','user')->orderByDesc("balance")->limit(8)->get();

        $crypto_wallets = UserWallet::auth()->whereHas("currency",function($q) {
            return $q->where("type",GlobalConst::CRYPTO);
        })->with('currency','user')->orderByDesc("balance")->limit(8)->get();

        $transactions = Transaction::auth()->latest()->take(5)->get();
        $data['totalReceiveRemittance'] =Transaction::auth()->remitance()->where('attribute',"RECEIVED")->where('status',1)->sum('request_amount');
        $data['totalSendRemittance'] =Transaction::auth()->remitance()->where('attribute',"SEND")->where('status',1)->sum('request_amount');
        $data['cardAmount'] =VirtualCard::where('user_id',auth()->user()->id)->sum('amount');
        $data['billPay'] = Transaction::auth()->billPay()->where('status',1)->sum('request_amount');
        $data['topUps'] = Transaction::auth()->mobileTopup()->where('status',1)->sum('request_amount');
        $data['withdraw'] = Transaction::auth()->moneyOut()->where('status',1)->sum('request_amount');
        $data['toatlTransactions'] = Transaction::auth()->where('status',1)->sum('request_amount');

select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'ADD-MONEY' and date(`created_at`) = '2023-10-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'ADD-MONEY' and date(`created_at`) = '2023-10-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'ADD-MONEY' and date(`created_at`) = '2023-10-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'ADD-MONEY' and date(`created_at`) = '2023-10-01' and `status` = 3
---
            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();

select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'MONEY-OUT' and date(`created_at`) = '2023-10-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'MONEY-OUT' and date(`created_at`) = '2023-10-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'MONEY-OUT' and date(`created_at`) = '2023-10-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'MONEY-OUT' and date(`created_at`) = '2023-10-01' and `status` = 3
---
            $hold_data[]     = $hold;

              // Monthley money Out
              $money_pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $money_success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                ->whereDate('created_at',$start_date)
                                ->where('status', 1)
                                ->count();
            $money_canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                ->whereDate('created_at',$start_date)
                                ->where('status', 4)
                                ->count();
            $money_hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                            ->whereDate('created_at',$start_date)
                            ->where('status', 3)
                            ->count();