app/Http/Controllers/User/MakePaymentController.php

select * from `transaction_settings` where `slug` = 'make-payment' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'MAKE-PAYMENT' order by `created_at` desc limit 10
---
    public function index() {
        $page_title = "Make Payment";
        $currencies = Currency::active()->get();
        $makePaymentCharge = TransactionSetting::where('slug','make-payment')->where('status',1)->first();
        $transactions = Transaction::auth()->makePayment()->latest()->take(10)->get();

select * from `merchants` where `email` = 'merchant@appdevs.net' limit 1
---
    public function checkUser(Request $request){
        $email = $request->email;
        $exist['data'] = Merchant::where('email',$email)->first();

select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `transaction_settings` where `slug` = 'make-payment' and `status` = 1 limit 1
---
    public function confirmed(Request $request){

        $request->validate([
            'amount'            => 'required|numeric|gt:0',
            'email'             => 'required|email',
            'wallet_currency'   => 'required'
        ]);
        $basic_setting = BasicSettings::first();
        $wallet_currency = $request->wallet_currency;
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => ['Please submit kyc information']]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => ['Please wait before admin approved your kyc information']]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => ['Admin rejected your kyc information, Please re-submit again']]);
            }
        }
        $amount = $request->amount;
        $user = auth()->user();
        $makePaymentCharge = TransactionSetting::where('slug','make-payment')->where('status',1)->first();

select * from `merchants` where `email` = 'merchant@appdevs.net' limit 1
select * from `merchant_wallets` where `merchant_id` = 1 limit 1
---
            return back()->with(['error' => ['Default currency not found']]);
        }
        $rate = $baseCurrency->rate;
        $receiver = Merchant::where('email', $request->email)->first();
        if(!$receiver){
            return back()->with(['error' => ['Receiver not exist']]);
        }
        $receiverWallet = MerchantWallet::where('merchant_id',$receiver->id)->first();

update `user_wallets` set `balance` = 89763.88, `user_wallets`.`updated_at` = '2023-12-06 14:53:49' where `id` = 3
---
    public function insertSender($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver,$charges) {
        $trx_id = $trx_id;
        $authWallet = $userWallet;
        $afterCharge = ($authWallet->balance - $payable);
        $details =[
            'receiver_username'=> $receiver->username,
            'receiver_email'=> $receiver->email,
            'sender_username'=> $user->username,
            'sender_email'=> $user->email,
            'charges' => $charges,
            'recipient_amount' => $recipient,
            'receiver' => $receiver,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $user->id,
                'user_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPEMAKEPAYMENT,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPEMAKEPAYMENT," ")) . " To " .$receiver->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::SEND,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateSenderWalletBalance($authWallet,$afterCharge);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (121, 4.82, 231.66, 236.48, '2023-12-06 14:53:49')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('MAKE-PAYMENT', 1, '{\"title\":\"Make Payment\",\"message\":\"Payment to  Test Merchant 482 USD successful\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-12-06 14:53:49', '2023-12-06 14:53:49')
---
    public function insertSenderCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Make Payment",
                'message'       => "Payment to  ".$receiver->fullname.' ' .$amount.' '.get_default_currency_code()." successful",
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::MAKE_PAYMENT,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);

update `merchant_wallets` set `balance` = 5522, `merchant_wallets`.`updated_at` = '2023-12-06 14:53:49' where `id` = 1
---
    public function insertReceiver($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver,$receiverWallet,$charges) {
        $trx_id = $trx_id;
        $receiverWallet = $receiverWallet;
        $recipient_amount = ($receiverWallet->balance + $recipient);
        $details =[
            'receiver_username'=> $receiver->username,
            'receiver_email'=> $receiver->email,
            'sender_username'=> $user->username,
            'sender_email'=> $user->email,
            'charges' => $charges,
            'recipient_amount' => $recipient,
            'receiver' => $receiver,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'merchant_id'                       => $receiver->id,
                'merchant_wallet_id'                => $receiverWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPEMAKEPAYMENT,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $recipient_amount,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPEMAKEPAYMENT," ")) . " From " .$user->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::RECEIVED,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateReceiverWalletBalance($receiverWallet,$recipient_amount);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (122, 4.82, 231.66, 0, '2023-12-06 14:53:49')
insert into `merchant_notifications` (`type`, `merchant_id`, `message`, `updated_at`, `created_at`) values ('MAKE-PAYMENT', 1, '{\"title\":\"Make Payment\",\"message\":\"Payment from  Test User 482 USD successful\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-12-06 14:53:49', '2023-12-06 14:53:49')
---
    public function insertReceiverCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>0,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Make Payment",
                'message'       => "Payment from  ".$user->fullname.' ' .$amount.' '.get_default_currency_code()." successful",
                'image'         => files_asset_path('profile-default'),
            ];

            MerchantNotification::create([
                'type'      => NotificationConst::MAKE_PAYMENT,
                'merchant_id'  => $receiver->id,
                'message'   => $notification_content,
            ]);