app/Http/Controllers/User/MobileTopupController.php

    public function index() {
        $page_title = "Mobile Topup";
        $sender_wallets = UserWallet::auth()->whereHas('currency',function($q) {
            $q->where("sender",GlobalConst::ACTIVE)->where("status",GlobalConst::ACTIVE);
        })->active()->get();
        $charges = TransactionSetting::where('slug','mobile_topup')->where('status',1)->first();
        $topup_type = TopupCategory::active()->orderByDesc('id')->get();
        $transactions = Transaction::auth()->mobileTopup()->latest()->take(10)->get();
---
select * from `user_wallets` where `user_id` = 1 and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `sender` = 1 and `status` = 1) and `status` = 1
select * from `transaction_settings` where `slug` = 'mobile_topup' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'MOBILE-TOPUP' order by `created_at` desc limit 10