app/Http/Controllers/User/MoneyOutController.php

    public function index() {

        $page_title = "Money Out";
        $currencies = Currency::active()->get();
        $makePaymentCharge = TransactionSetting::where('slug','money-out')->where('status',1)->first();
        $transactions = Transaction::auth()->MoneyOut()->latest()->take(10)->get();
---
select * from `transaction_settings` where `slug` = 'money-out' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' order by `created_at` desc limit 10

    public function confirmed(Request $request){

        $request->validate([
            'amount'            => 'required|numeric|gt:0',
            'email'             => 'required|email',
            'wallet_currency'   => 'required'
        ]);
        $basic_setting = BasicSettings::first();
        $wallet_currency = $request->wallet_currency;
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => ['Please submit kyc information']]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => ['Please wait before admin approved your kyc information']]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => ['Admin rejected your kyc information, Please re-submit again']]);
            }
        }
        $amount = $request->amount;
        $user = auth()->user();
        $makePaymentCharge = TransactionSetting::where('slug','money-out')->where('status',1)->first();
---
select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `transaction_settings` where `slug` = 'money-out' and `status` = 1 limit 1

            return back()->with(['error' => ['Default currency not found']]);
        }
        $rate = $baseCurrency->rate;
        $receiver = Agent::where('email', $request->email)->first();
        if(!$receiver){
            return back()->with(['error' => ['Receiver not exist']]);
        }
        $receiverWallet = AgentWallet::where('agent_id',$receiver->id)->first();
---
select * from `agents` where `email` = 'agent@appdevs.net' limit 1
select * from `agent_wallets` where `agent_id` = 1 limit 1

    public function insertSender($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver,$charges) {
        $trx_id = $trx_id;
        $authWallet = $userWallet;
        $afterCharge = ($authWallet->balance - $payable);
        $details =[
            'receiver_username'=> $receiver->username,
            'receiver_email'=> $receiver->email,
            'sender_username'=> $user->username,
            'sender_email'=> $user->email,
            'charges' => $charges,
            'recipient_amount' => $recipient,
            'receiver' => $receiver,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $user->id,
                'user_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPEMONEYOUT,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPEMONEYOUT," ")) . " To " .$receiver->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::SEND,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateSenderWalletBalance($authWallet,$afterCharge);
---
update `user_wallets` set `balance` = 935.65, `user_wallets`.`updated_at` = '2023-12-06 16:52:47' where `id` = 1

    public function insertSenderCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Make Payment",
                'message'       => "Payment to  ".$receiver->fullname.' ' .$amount.' '.get_default_currency_code()." successful",
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::WITHDRAW,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (6, 0.2, 3, 3.2, '2023-12-06 16:52:47')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('MONEY_OUT', 1, '{\"title\":\"Make Payment\",\"message\":\"Payment to  Test Agent 20 USD successful\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-12-06 16:52:47', '2023-12-06 16:52:47')