app/Http/Controllers/User/ReceipientController.php

select * from `receipients` where `user_id` = 1 order by `id` desc limit 12 offset 0
select count(*) as aggregate from `receipients` where `user_id` = 1
---
    public function index()
    {
        $page_title = "All Recipient";
        $token = (object)session()->get('remittance_token');
        $user = auth()->user();

        if(@$token ->transacion_type != null && @$token ->receiver_country == null){

            $receipients = Receipient::auth()->where('type',$token->transacion_type)->orderByDesc("id")->paginate(12);
        }elseif(@$token ->transacion_type != null && @$token ->receiver_country != null){

            $receipients = Receipient::auth()->where('type',$token->transacion_type)->where('country',@$token->receiver_country)->orderByDesc("id")->paginate(12);
        }else{
            $receipients = Receipient::auth()->orderByDesc("id")->paginate(12);