app/Http/Controllers/User/RemitanceController.php

    public function index() {
        $page_title = "Remittance";
        $exchangeCharge = TransactionSetting::where('slug','remittance')->where('status',1)->first();
        $receiverCountries = ReceiverCounty::active()->get();
        $receipients = Receipient::auth()->orderByDesc("id")->paginate(12);
        $transactions = Transaction::auth()->remitance()->latest()->take(5)->get();
        $defaultCurrency = Currency::where('default',true)->first();
        $sender_wallets = UserWallet::auth()->whereHas('currency',function($q) {
            $q->where("sender",GlobalConst::ACTIVE)->where("status",GlobalConst::ACTIVE);
        })->active()->get();
---
select * from `transaction_settings` where `slug` = 'remittance' and `status` = 1 limit 1
select count(*) as aggregate from `receipients` where `user_id` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' order by `created_at` desc limit 5
select * from `currencies` where `default` = 1 limit 1
select * from `user_wallets` where `user_id` = 1 and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `sender` = 1 and `status` = 1) and `status` = 1

    public function getRecipientByCountry(Request $request){
        $receiver_country = $request->receiver_country;
        $transacion_type = $request->transacion_type;
        if( $transacion_type != null || $transacion_type != ''){
            $data['recipient'] = Receipient::auth()->where('country', $receiver_country)->where('type',$transacion_type)->get();
---
select * from `receipients` where `user_id` = 1 and `country` = '1' and `type` = 'bank-transfer'

    public function getRecipientByTransType(Request $request){
        $receiver_country = $request->receiver_country;
        $transacion_type = $request->transacion_type;
          $data['recipient'] = Receipient::auth()->where('country', $receiver_country)->where('type',$transacion_type)->get();
---
select * from `receipients` where `user_id` = 1 and `country` = '1' and `type` = 'bank-transfer'