app/Http/Controllers/User/SudoVirtualCardController.php

select * from `virtual_card_apis` limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::first();

select * from `sudo_virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5
select * from `currencies` where `currencies`.`id` in (1, 2, 3)
select * from `user_wallets` where `user_id` = 1 and `status` = 1
---
    public function index()
    {

        $page_title = "Virtual Card";
        $myCards = SudoVirtualCard::where('user_id',auth()->user()->id)->get();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(5)->get();
        $cardApi = $this->api;

        $sender_wallets = UserWallet::with(['currency'])->auth()->where('status',true)->get();