app/Http/Controllers/User/VirtualcardController.php

select * from `virtual_card_apis` limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::first();

select * from `virtual_cards` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5
---
    public function index()
    {
        $page_title = "Virtual Card";
        $myCard = VirtualCard::where('user_id',auth()->user()->id)->first();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(5)->get();

select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
---
    public function cardBuy(Request $request)
    {
        $request->validate([
            'card_amount' => 'required|numeric|gt:0',
            'currency' => "nullable|string|exists:currencies,code",
        ]);

        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        $wallet_currency = $request->currency;
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => ['Please submit kyc information']]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => ['Please wait before admin approved your kyc information']]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => ['Admin rejected your kyc information, Please re-submit again']]);
            }
        }
        $amount = $request->card_amount;
        $wallet = UserWallet::auth()->whereHas("currency",function($q) use ($wallet_currency) {
            $q->where("code",$wallet_currency)->active();
        })->active()->first();

        if(!$wallet){
            return back()->with(['error' => ['Wallet not found']]);
        }

        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();