app/Http/Controllers/User/VirtualcardController.php

    public function index()
    {
        $page_title = "Virtual Card";
        $myCard = VirtualCard::where('user_id',auth()->user()->id)->first();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(5)->get();
        $stripe_cards   = StripeCard::all();
---
select * from `stripe_cards`