app/Http/Controllers/User/WithdrawController.php

select * from `currencies` where `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1)
select * from `transactions` where `user_id` = 1 and `type` = 'WITHDRAW' order by `id` desc, `created_at` desc limit 10
---
    public function index()
    {
        $page_title = "Withdraw Money";
        $currencies = Currency::active()->get();
        $payment_gateways = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::money_out_slug());
            $gateway->where('status', 1);
        })->get();

        $transactions = Transaction::auth()->withdraw()->orderByDesc("id")->latest()->take(10)->get();