app/Http/Helpers/helpers.php

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 5
select * from `agent_notifications` where `agent_id` = 1 order by `created_at` desc limit 5
---
function get_user_notifications()
{
    if(auth()->guard('web')->check()){
        $user = auth()->user();
        $notifications = UserNotification::auth()->latest()->take(5)->get();
        return $notifications;
    } else if(auth()->guard('merchant')->check()){
        $user = auth()->user();
        $notifications = MerchantNotification::auth()->latest()->take(5)->get();
        return $notifications;
    } else if(auth()->guard('agent')->check()){
        $user = auth()->user();
        $notifications = AgentNotification::auth()->latest()->take(5)->get();

select * from `languages` where `status` = 1 limit 1
---
function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `user_wallets` where `user_id` = 1 limit 1
---
function authWalletBalance(){
    if(auth()->guard('web')->check()){
        $wallet = UserWallet::where('user_id',auth()->user()->id)->first();

select * from `admins` where exists (select * from `admin_has_roles` where `admins`.`id` = `admin_has_roles`.`admin_id` and exists (select * from `admin_roles` where `admin_has_roles`.`admin_role_id` = `admin_roles`.`id` and `name` = 'Super Admin')) limit 1
---
function get_super_admin() {
    $super_admin_const = AdminRoleConst::SUPER_ADMIN;
    $super_admin = Admin::whereHas('roles',function($query) use ($super_admin_const) {
        $query->whereHas('role',function($query_role) use ($super_admin_const) {
            $query_role->where('name', $super_admin_const);
        });
    })->first();

select * from `module_settings` where `user_type` = 'USER' and `slug` = 'add-money' limit 1
---
function module_access($key,$module = null)
{

    if (!$module) {
        $module = ModuleSetting::query();
    }

    return $module->where('user_type',userGuard()['type'])->where('slug',$key)->first();

select * from `module_settings` where `user_type` = 'USER' and `slug` = 'make-payment' limit 1
---
function module_access_api($key)
{
    $module = ModuleSetting::where('slug',$key)->where('user_type',userGuard()['type'])->first();

select * from `payment_gateways` where `type` = 'AUTOMATIC' and `alias` = 'flutterwave-money-out' limit 1
---
function getFlutterwaveBanks($iso2){
    $cardApi = PaymentGateway::where('type',"AUTOMATIC")->where('alias','flutterwave-money-out')->first();