app/Http/Helpers/helpers.php

function get_user_notifications()
{
    if(auth()->guard('web')->check()){
        $user = auth()->user();
        $notifications = UserNotification::auth()->latest()->take(5)->get();
---
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 5

function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `status` = 1 limit 1

function module_access($key,$module = null)
{

    if (!$module) {
        $module = ModuleSetting::query();
    }

    return $module->where('user_type',userGuard()['type'])->where('slug',$key)->first();
---
select * from `module_settings` where `user_type` = 'USER' and `slug` = 'remittance-money' limit 1