app/Http/Helpers/PaymentGateway.php

select * from `payment_gateway_currencies` where `alias` = 'paypal-aud-automatic' limit 1
select * from `user_wallets` where `user_id` = 1 and `currency_id` = 1 limit 1
select * from `agent_wallets` where `agent_id` = 1 and `currency_id` = 1 limit 1
select * from `currencies` where `id` = 1 limit 1
select * from `user_wallets` where `user_id` = 1 and `currency_id` = 2 limit 1
select * from `currencies` where `id` = 2 limit 1
---
    public function gateway() {
        $request_data = $this->request_data;

        if(empty($request_data)) throw new Exception("Gateway Information is not available. Please provide payment gateway currency alias");
        $validated = $this->validator($request_data)->validate();

        $gateway_currency = PaymentGatewayCurrency::where("alias",$validated[$this->currency_input_name])->first();

        if(!$gateway_currency || !$gateway_currency->gateway) {
            throw ValidationException::withMessages([
                $this->currency_input_name = "Gateway not available",
            ]);
        }


        // if(get_auth_guard() == 'web'){

        //     $user_wallet = UserWallet::auth()->where('currency_id', $defualt_currency->id)->first();
        // }else{

        //     $user_wallet = AgentWallet::auth()->where('currency_id', $defualt_currency->id)->first();
        // }
        if(userGuard()['type'] == "AGENT"){
            $user_wallet = AgentWallet::auth()->where('currency_id', $validated['sender_wallet'])->first();
            $defualt_currency = Currency::where('id',$user_wallet->currency_id)->first();
        }else{
            $user_wallet = UserWallet::auth()->where('currency_id',$validated['sender_wallet'])->first();
            $defualt_currency = Currency::where('id',$user_wallet->currency_id)->first();

select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 3 limit 1
---
    public function responseReceive($type = null) {
        $tempData = $this->request_data;

        if(empty($tempData) || empty($tempData['type'])) throw new Exception('Transaction Failed. Record didn\'t saved properly. Please try again.');

        $method_name = $tempData['type']."Success";

        if($this->requestIsApiUser()) {
            $creator_table = $tempData['data']->creator_table ?? null;
            $creator_id = $tempData['data']->creator_id ?? null;
            $creator_guard = $tempData['data']->creator_guard ?? null;
            $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
            if(!array_key_exists($creator_guard,$api_authenticated_guards)) throw new Exception('Request user doesn\'t save properly. Please try again');
            if($creator_table == null || $creator_id == null || $creator_guard == null) throw new Exception('Request user doesn\'t save properly. Please try again');
            $creator = DB::table($creator_table)->where("id",$creator_id)->first();
            if(!$creator) throw new Exception("Request user doesn\'t save properly. Please try again");
            $api_user_login_guard = $api_authenticated_guards[$creator_guard];
            $this->output['api_login_guard'] = $api_user_login_guard;
            Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
        }


        $method_name = $tempData['type']."Success";

        $currency_id = $tempData['data']->currency ?? "";
        $gateway_currency = PaymentGatewayCurrency::find($currency_id);