app/Http/Helpers/PaymentGatewayApi.php

select * from `payment_gateway_currencies` where `alias` = 'jazzcash-pkr-manual' limit 1
select * from `currencies` where `id` = '2' limit 1
select * from `user_wallets` where `user_id` = 1 and `currency_id` = 2 limit 1
select * from `agent_wallets` where `agent_id` = 1 and `currency_id` = 2 limit 1
---
    public function gateway() {
        $request_data = $this->request_data;

        if(empty($request_data)){
            $error = ['error'=>['Gateway Information is not available. Please provide payment gateway currency alias']];
            return Helpers::error($error);
        }
        $validated = $this->validator($request_data)->validate();
        $gateway_currency = PaymentGatewayCurrency::where("alias",$validated[$this->currency_input_name])->first();

        if(!$gateway_currency || !$gateway_currency->gateway) {

            $error = ['error'=>['Gateway not available']];
            return Helpers::error($error);
        }
        // $user_wallet = UserWallet::auth()->where('id', $validated['sender_wallet'])->first();

        // $defualt_currency = Currency::where('id',$user_wallet->currency_id)->first();
        // dd($defualt_currency->id,$user_wallet->id);


        if(request()->expectsJson()){

            if(userGuard()['type'] == "AGENT"){
                $user_wallet = AgentWallet::auth()->where('id', $validated['sender_wallet'])->first();
                $defualt_currency = Currency::where('id',$user_wallet->currency_id)->first();
            }else{
                $user_wallet = UserWallet::auth()->where('id', $validated['sender_wallet'])->first();

select * from `user_wallets` where `user_id` = 1 and `id` = '1' limit 1
select * from `currencies` where `id` = 1 limit 1
---
            $user_wallet = AgentWallet::where('agent_id',$user->id)->where('id', $validated['sender_wallet'])->first();
            $defualt_currency = Currency::where('id',$user_wallet->currency_id)->first();
            }else{
                $user_wallet = UserWallet::auth()->where('id', $validated['sender_wallet'])->first();
                $defualt_currency = Currency::where('id',$user_wallet->currency_id)->first();