app/Http/Helpers/sudo-card.php

select * from `virtual_card_apis` limit 1
---
function virtual_card_system($name)
{
    $method = VirtualCardApi::first();