app/Http/Controllers/Merchant/GatewaySettingController.php

    public function index()
    {
        $merchant = auth()->user();
        $page_title = "Gateway Settings";
        $setting = GatewaySetting::merchantAuth()->first();
---
select * from `gateway_settings` where `merchant_id` = 1 limit 1