app/Http/Controllers/Merchant/MoneyOutController.php

    public function index()
    {
        $page_title = "Withdraw Money";
        $currencies = Currency::active()->get();
        $payment_gateways = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::money_out_slug());
            $gateway->where('status', 1);
        })->get();
---
select * from `currencies` where `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1)

    public function paymentInsert(Request $request){
        $request->validate([
            'gateway'           => "required|exists:payment_gateway_currencies,alias",
            'amount'            => "required|numeric|gt:0",
            'wallet_currency'   => "required|exists:currencies,code",
        ]);
        $amount = $request->amount;
        $wallet_currency = $request->wallet_currency;
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => ['Please submit kyc information']]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => ['Please wait before admin approved your kyc information']]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => ['Admin rejected your kyc information, Please re-submit again']]);
            }
        }


        $userWallet = MerchantWallet::auth()->whereHas("currency",function($q) use ($wallet_currency) {
            $q->where("code",$wallet_currency)->active();
        })->active()->first();

        $gate =PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::money_out_slug());
            $gateway->where('status', 1);
        })->where('alias',$request->gateway)->first();
---
select * from `basic_settings` limit 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1) and `alias` = 'flutterwave-ngn-money-out-automatic' limit 1