app/Http/Controllers/Merchant/WalletController.php

    public function balance(Request $request) {
        $validator = Validator::make($request->all(),[
            'target'        => "required|string",
        ]);

        if($validator->fails()) {
            return Response::error($validator->errors(),null,400);
        }

        $validated = $validator->validate();

        try{
            $wallet = MerchantWallet::auth()->whereHas("currency",function($q) use ($validated) {
                $q->where("code",$validated['target']);
            })->first();
---
select * from `merchant_wallets` where `merchant_id` = 1 and exists (select * from `currencies` where `merchant_wallets`.`currency_id` = `currencies`.`id` and `code` = 'USD') limit 1