app/Traits/PaymentGateway/Paypal.php

    public function paypalPaymentCaptured($response,$output) {
        // payment successfully captured record saved to database
        $output['capture'] = $response;
        $basic_setting = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function updateWalletBalance($output) {
        $update_amount = $output['wallet']->balance + ($output['amount']->requested_amount);

        $output['wallet']->update([
            'balance'   => $update_amount,
        ]);
---
update `user_wallets` set `balance` = 11126, `user_wallets`.`updated_at` = '2023-12-05 14:37:00' where `id` = 2

    public function insertCharges($output,$id) {


        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $output['amount']->percent_charge,
                'fixed_charge'      => $output['amount']->fixed_charge,
                'total_charge'      => $output['amount']->total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         => "Add Money",
                'message'       => "Your Wallet (".$output['wallet']->currency->code.") balance  has been added ".$output['amount']->requested_amount.' '. $output['wallet']->currency->code,
                'time'          => Carbon::now()->diffForHumans(),
                'image'         => files_asset_path('profile-default'),
            ];
            if(get_auth_guard() == 'web'){
                UserNotification::create([
                    'type'      => NotificationConst::BALANCE_ADDED,
                    'user_id'  =>  auth()->user()->id,
                    'message'   => $notification_content,
                ]);
            }else{
                AgentNotification::create([
                    'type'      => NotificationConst::BALANCE_ADDED,
                    'agent_id'  =>  auth()->user()->id,
                    'message'   => $notification_content,
                ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (87, 1, 2, 3, '2023-12-05 14:37:00')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('BALANCE_ADDED', 1, '{\"title\":\"Add Money\",\"message\":\"Your Wallet (XOF) balance  has been added 100 XOF\",\"time\":\"1 second ago\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-12-05 14:37:00', '2023-12-05 14:37:00')
insert into `agent_notifications` (`type`, `agent_id`, `message`, `updated_at`, `created_at`) values ('BALANCE_ADDED', 1, '{\"title\":\"Add Money\",\"message\":\"Your Wallet (USD) balance  has been added 11 USD\",\"time\":\"1 second ago\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-12-10 09:52:03', '2023-12-10 09:52:03')

    public function insertDevice($output,$id) {
        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);
        $agent = new Agent();

        // $mac = exec('getmac');
        // $mac = explode(" ",$mac);
        // $mac = array_shift($mac);
        $mac = "";

        DB::beginTransaction();
        try{
            DB::table("transaction_devices")->insert([
                'transaction_id'=> $id,
                'ip'            => $client_ip,
                'mac'           => $mac,
                'city'          => $location['city'] ?? "",
                'country'       => $location['country'] ?? "",
                'longitude'     => $location['lon'] ?? "",
                'latitude'      => $location['lat'] ?? "",
                'timezone'      => $location['timezone'] ?? "",
                'browser'       => $agent->browser() ?? "",
                'os'            => $agent->platform() ?? "",
            ]);
---
insert into `transaction_devices` (`transaction_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`) values (87, '::1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows')

    public function removeTempData($output) {
        $token = $output['capture']['id'];
        TemporaryData::where("identifier",$token)->delete();
---
delete from `temporary_datas` where `identifier` = '1MJ35637TP982581L'