app/Http/Controllers/User/Auth/RegisterController.php

    public function sendVerifyCode(Request $request){
        $basic_settings = $this->basic_settings;
        if($basic_settings->agree_policy){
            $agree = 'required';
        }else{
            $agree = '';
        }
        $validator = Validator::make($request->all(),[
            'email'         => 'required|email',
            'agree'         =>  $agree,

        ]);
        $validated = $validator->validate();
        $field_name = "username";
        if(check_email($validated['email'])) {
            $field_name = "email";
        }

        $exist = User::where($field_name,$validated['email'])->first();
        if( $exist) return back()->with(['error' => ['User already  exists, please try with another email']]);
---
select * from `users` where `email` = 'user3@appdevs.net' limit 1

    public function verifyCode(Request $request,$token){
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:user_authorizations,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ]);
        $code = $request->code;
        $code = implode("",$code);
        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("token",$request->token)->where("code",$code)->first();
        if(!$auth_column){
            return back()->with(['error' => ['Verification code does not match']]);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();
            return redirect()->route('user.register')->with(['error' => ['Session expired. Please try again']]);
        }
        try{
            $auth_column->delete();
---
delete from `user_authorizations` where `id` = 4