app/Http/Controllers/Api/User/Auth/LoginController.php

select * from `users` where `email` = 'akashappdevs@gmail.com' limit 1
---
    public function login(Request $request){
        $validator = Validator::make($request->all(), [
            'email' => 'required|email|max:50',
            'password' => 'required|min:6',
        ]);

        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return ApiHelpers::validation($error);
        }

        $user = User::where('email',$request->email)->first();

update `users` set `kyc_verified` = 2, `users`.`updated_at` = '2023-12-03 14:55:22' where `id` = 11
---
                DB::commit();
            }catch(Exception $e) {
                DB::rollBack();
                $user->update([
                    'kyc_verified'  => GlobalConst::DEFAULT,
                ]);

insert into `users` (`firstname`, `lastname`, `email`, `mobile`, `mobile_code`, `full_mobile`, `referral_id`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('amir', 'sohel', 'akashappdevs@gmail.com', '1797172222', ' 880', ' 8801797172222', '01183433', '$2y$10$vjD/fFtIwVCcQLRspAW.3etuApUQiJ51FIpvXLJem7DXzdo0oS6ly', 'amirsohel', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"2252\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 0, 1, 0, '2023-12-03 14:55:22', '2023-12-03 14:55:22')
---
            }

           }
        $token = $user->createToken('user_token')->accessToken;