app/Http/Controllers/Agent/Auth/ForgotPasswordController.php

select * from `agent_password_resets` where `token` = 'baBQoZNq5sQ42AOb33bD4FHOe7ANwiHskCRudmsvBO3zqxcBllaki7hDPV6adA6k1bWJtQy28FVuMuhK' limit 1
---
    public function showVerifyForm($token) {
        $page_title = setPageTitle("Verify Agent");
        $password_reset = AgentPasswordReset::where("token",$token)->first();