app/Http/Controllers/Agent/AddMoneyController.php

select * from `agent_wallets` where `agent_id` = 1
select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `status` = 1) and `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'add-money' and `status` = 1)
select * from `transactions` where `agent_id` = 1 and `type` = 'ADD-MONEY' order by `created_at` desc limit 10
---
    public function index() {

        $page_title         = "Add Money";
        $user_wallets       = AgentWallet::auth()->get();
        $user_currencies    = AgentWallet::auth()->whereHas('currency',function($q) {
            $q->where("status",GlobalConst::ACTIVE);
        })->active()->get();
        $payment_gateways_currencies = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::add_money_slug());
            $gateway->where('status', 1);
        })->get();
        $transactions = Transaction::agentAuth()->addMoney()->latest()->take(10)->get();

select * from `basic_settings` limit 1
---
    public function submit(Request $request) {
        $basic_setting = BasicSettings::first();

select * from `temporary_datas` where `type` = 'paypal' and `identifier` = '0TU33990Y9634672V' limit 1
---
    public function success(Request $request, $gateway){
        $requestData = $request->all();
        $token = $requestData['token'] ?? "";
        $checkTempData = TemporaryData::where("type",$gateway)->where("identifier",$token)->first();

select * from `stripe_cards` where `agent_id` = 1 order by `id` desc limit 10 offset 0
select count(*) as aggregate from `stripe_cards` where `agent_id` = 1
select * from `temporary_datas` where `identifier` = 'wzmvyOx9FOMVFdvJ' and `type` = 'stripe' limit 1
---
    public function payment($gateway){
        $page_title     = "Stripe Payment";
        $tempData       = Session::get('identifier');
        $stripe_cards   = StripeCard::where('agent_id',auth()->user()->id)->orderByDESC('id')->paginate(10);
        $hasData        = TemporaryData::where('identifier', $tempData)->where('type',$gateway)->first();