app/Http/Controllers/Agent/BillPayController.php

    public function payConfirm(Request $request){
        $validated = Validator::make($request->all(),[
            'sender_amount'     => "required|numeric|gt:0",
            'sender_currency'   => "required|string|exists:currencies,code",
            'bill_type'         => "required|string|max:300",
            'bill_number'         => "required",
        ])->validate();
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('agent.profile.index')->with(['error' => ['Please submit kyc information']]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('agent.profile.index')->with(['error' => ['Please wait before admin approved your kyc information']]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('agent.profile.index')->with(['error' => ['Admin rejected your kyc information, Please re-submit again']]);
            }
        }

        $sender_wallet = AgentWallet::where('agent_id',auth()->user()->id)->whereHas("currency",function($q) use ($validated) {
            $q->where("code",$validated['sender_currency'])->active();
        })->active()->first();
        if(!$sender_wallet) return back()->with(['error' => ['Your wallet isn\'t available with currency ('.$validated['sender_currency'].')']]);
        $trx_charges = TransactionSetting::where('slug','bill_pay')->where('status',1)->first();;
        $charges = $this->billPayCharge($validated['sender_amount'],$trx_charges,$sender_wallet);

        $bill_type = BillPayCategory::where('slug', $validated['bill_type'])->first();
---
select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `transaction_settings` where `slug` = 'bill_pay' and `status` = 1 limit 1
select * from `bill_pay_categories` where `slug` = 'gas' limit 1

    public function insertSender( $trx_id,$sender_wallet, $charges, $bill_type,$bill_number) {
        $trx_id = $trx_id;
        $authWallet = $sender_wallet;
        $afterCharge = ($authWallet->balance -  $charges['payable']);
        $details =[
            'bill_type_id' => $bill_type->id??'',
            'bill_type_name' => $bill_type->name??'',
            'bill_number' => $bill_number,
            'bill_amount' => $charges['sender_amount']??"",
            'charges' => $charges,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'agent_id'                       => $authWallet->agent_id,
                'agent_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::BILLPAY,
                'trx_id'                        => $trx_id,
                'request_amount'                => $charges['sender_amount'],
                'payable'                       => $charges['payable'],
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::BILLPAY," ")) . " Request To Admin",
                'details'                       => json_encode($details),
                'attribute'                     =>PaymentGatewayConst::SEND,
                'status'                        => 2,
                'created_at'                    => now(),
            ]);

            $this->updateSenderWalletBalance($authWallet,$afterCharge);
---
update `agent_wallets` set `balance` = 62.81, `agent_wallets`.`updated_at` = '2023-10-17 10:47:22' where `id` = 3

    public function insertSenderCharges($id,$charges,$sender_wallet) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    =>  $id,
                'percent_charge'    =>  $charges['percent_charge'],
                'fixed_charge'      =>  $charges['fixed_charge'],
                'total_charge'      =>  $charges['total_charge'],
                'created_at'        =>  now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Bill Pay ",
                'message'       => "Bill Pay Request Send To Admin " .$charges['sender_amount'].' '.$charges['sender_currency']." Successful.",
                'image'         => get_image($sender_wallet->agent->image,'user-profile'),
            ];

            AgentNotification::create([
                'type'      => NotificationConst::BILL_PAY,
                'agent_id'  => $sender_wallet->agent->id,
                'message'   => $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (21, 7.75, 154.44, 162.19, '2023-10-17 10:47:22')
insert into `agent_notifications` (`type`, `agent_id`, `message`, `updated_at`, `created_at`) values ('BILL-PAY', 1, '{\"title\":\"Bill Pay \",\"message\":\"Bill Pay Request Send To Admin 775 AFN Successful.\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/default.webp\"}', '2023-10-17 10:47:22', '2023-10-17 10:47:22')


           //admin notification
           $notification_content['title'] = "Bill Pay Request Send To Admin  ".$charges['sender_amount'].' '.$charges['sender_currency'].' Successful ('.$sender_wallet->agent->username.')';
           AdminNotification::create([
               'type'      => NotificationConst::BILL_PAY,
               'admin_id'  => 1,
               'message'   => $notification_content,
           ]);
---
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('BILL-PAY', 1, '{\"title\":\"Bill Pay Request Send To Admin  775 AFN Successful (testagent)\",\"message\":\"Bill Pay Request Send To Admin 775 AFN Successful.\",\"image\":\"http:\/\/localhost\/payzen\/public\/backend\/images\/default\/default.webp\"}', '2023-10-17 10:47:24', '2023-10-17 10:47:24')