app/Http/Controllers/Agent/DashboardController.php

    public function index()
    {
        $page_title = "Agent Dashboard";
        $baseCurrency = Currency::default();
        $transactions = Transaction::agentAuth()->latest()->take(5)->get();
        $fiat_wallets = AgentWallet::auth()->whereHas("currency",function($q) {
            return $q->where("type",GlobalConst::FIAT);
        })->with('currency','agent')->orderByDesc("balance")->limit(8)->get();

        $crypto_wallets = AgentWallet::auth()->whereHas("currency",function($q) {
            return $q->where("type",GlobalConst::CRYPTO);
        })->with('currency','agent')->orderByDesc("balance")->limit(8)->get();

        $data['totalReceiveRemittance'] =Transaction::agentAuth()->remitance()->where('attribute',"RECEIVED")->sum('request_amount');
        $data['totalSendRemittance'] =Transaction::agentAuth()->remitance()->where('attribute',"SEND")->sum('request_amount');
        $data['billPay'] = Transaction::agentAuth()->billPay()->sum('request_amount');
        $data['topUps'] = Transaction::agentAuth()->mobileTopup()->sum('request_amount');
        $data['toatlTransactions'] = Transaction::agentAuth()->where('status', 1)->count();
---
select * from `transactions` where `agent_id` = 1 order by `created_at` desc limit 5
select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `type` = 'FIAT') order by `balance` desc limit 8
select * from `agents` where `agents`.`id` in (1)
select * from `currencies` where `currencies`.`id` in (1, 2)
select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `type` = 'CRYPTO') order by `balance` desc limit 8
select * from `currencies` where `currencies`.`id` in (3)
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'RECEIVED'
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'SEND'
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'BILL-PAY'
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'MOBILE-TOPUP'
select count(*) as aggregate from `transactions` where `agent_id` = 1 and `status` = 1