app/Http/Controllers/Agent/MoneyOutController.php

select * from `currencies` where `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1)
---
    public function index(){
        $page_title         = "Withdraw Money";
        $currencies         = Currency::active()->get();
        $payment_gateways   = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::money_out_slug());
            $gateway->where('status', 1);
        })->get();

select * from `payment_gateways` where `id` = 17 limit 1
---
   public function preview(){
    $moneyOutData = (object)session()->get('moneyoutData');
    $moneyOutDataExist = session()->get('moneyoutData');
    if($moneyOutDataExist  == null){
        return redirect()->route('agent.withdraw.index');
    }
    $gateway = PaymentGateway::where('id', $moneyOutData->gateway_id)->first();