app/Http/Controllers/Agent/ReceipientController.php

select * from `receipients` where `agent_id` = 1 and `email` = 'agent5@appdevs.net' limit 1
---
    public function storeReceipient(Request $request){
        $user = auth()->user();
        if($request->transaction_type == 'bank-transfer') {
            $bankRules = 'required|string';
        }else {
            $bankRules = 'nullable|string';
        }

        if($request->transaction_type == 'cash-pickup') {
            $cashPickupRules = "required|string";
        }else {
            $cashPickupRules = "nullable";
        }
        $request->validate([
            'transaction_type'      =>'required|string',
            'country'               =>'required',
            'firstname'             =>'required|string',
            'lastname'              =>'required|string',
            'email'                 =>"required|email",
            'mobile'                =>"required",
            'mobile_code'           =>'required',
            'city'                  =>'required|string',
            'address'               =>'required|string',
            'state'                 =>'required|string',
            'zip'                   =>'required|string',
            'bank'                  => $bankRules,
            'cash_pickup'           => $cashPickupRules,

        ]);
            $checkMobile = Receipient::where('agent_id',$user->id)->where('email',$request->email)->first();

select * from `receiver_counties` where `id` = '2' limit 1
---
                return back()->with(['error' => ['This recipient  already exist.']]);
            }

            $country = ReceiverCounty::where('id',$request->country)->first();

select * from `remitance_bank_deposits` where `alias` = 'mcb-bank-limited' limit 1
---

        if($request->transaction_type == 'bank-transfer') {
            $alias  = $request->bank;
            $details = RemitanceBankDeposit::where('alias',$alias)->first();