app/Http/Controllers/Agent/RemitanceController.php

select * from `transaction_settings` where `slug` = 'remittance' and `status` = 1 limit 1
select * from `transactions` where `agent_id` = 1 and `type` = 'REMITTANCE' order by `created_at` desc limit 5
select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `sender` = 1 and `status` = 1) and `status` = 1
---
    public function index() {
        $page_title         = "Remittance";
        $exchangeCharge     = TransactionSetting::where('slug','remittance')->where('status',1)->first();
        $receiverCountries  = ReceiverCounty::active()->get();
        $transactions       = Transaction::agentAuth()->remitance()->latest()->take(5)->get();
        $sender_wallets     = AgentWallet::auth()->whereHas('currency',function($q) {
            $q->where("sender",GlobalConst::ACTIVE)->where("status",GlobalConst::ACTIVE);
        })->active()->get();