app/Http/Controllers/Agent/SendMoneyController.php

    public function index() {
        $page_title = "Send Money";
        $sender_wallets = AgentWallet::auth()->whereHas('currency',function($q) {
            $q->where("sender",GlobalConst::ACTIVE)->where("status",GlobalConst::ACTIVE);
        })->active()->get();

        $receiver_wallets = Currency::receiver()->active()->get();

        $sendMoneyCharge = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $transactions = Transaction::agentAuth()->senMoney()->latest()->take(10)->get();
---
select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `sender` = 1 and `status` = 1) and `status` = 1
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `transactions` where `agent_id` = 1 and `type` = 'TRANSFER-MONEY' order by `created_at` desc limit 10

    public function checkUser(Request $request){
        $email = $request->email;
        $exist['data'] = Agent::where('email',$email)->first();
---
select * from `agents` where `email` = 'agent@appdevs.net' limit 1