app/Http/Controllers/Agent/WalletController.php

select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `type` = 'FIAT') order by `balance` desc
select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `type` = 'CRYPTO') order by `balance` desc
---
    public function index()
    {
        $page_title = "All Wallets";
        $fiat_wallets = AgentWallet::auth()->whereHas("currency",function($q) {
            return $q->where("type",GlobalConst::FIAT);
        })->orderByDesc("balance")->get();

        $crypto_wallets = AgentWallet::auth()->whereHas("currency",function($q) {
            return $q->where("type",GlobalConst::CRYPTO);
        })->orderByDesc("balance")->get();

select * from `agent_wallets` where `agent_id` = 1 and exists (select * from `currencies` where `agent_wallets`.`currency_id` = `currencies`.`id` and `code` = 'XOF') limit 1
---
    public function balance(Request $request) {
        $validator = Validator::make($request->all(),[
            'target'        => "required|string",
        ]);

        if($validator->fails()) {
            return Response::error($validator->errors(),null,400);
        }

        $validated = $validator->validate();

        try{
            $wallet = AgentWallet::auth()->whereHas("currency",function($q) use ($validated) {
                $q->where("code",$validated['target']);
            })->first();