app/Traits/User/RegisteredUsers.php

insert into `user_wallets` (`balance`, `created_at`, `currency_id`, `status`, `user_id`) values (0, '2023-12-03 14:55:26', 1, 1, 11), (0, '2023-12-03 14:55:26', 2, 1, 11), (0, '2023-12-03 14:55:26', 3, 1, 11)
---
    protected function createUserWallets($user) {
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();
        $wallets = [];
        foreach($currencies as $currency_id) {
            $wallets[] = [
                'user_id'       => $user->id,
                'currency_id'   => $currency_id,
                'balance'       => 0,
                'status'        => true,
                'created_at'    => now(),
            ];
        }

        try{
            UserWallet::insert($wallets);

select exists(select * from `users` where `referral_id` = '10687163') as `exists`
select * from `users` where `referral_id` = '10687163' limit 1
insert into `referred_users` (`refer_user_id`, `new_user_id`, `created_at`, `updated_at`) values (3, 11, '2023-12-03 14:55:26', '2023-12-03 14:55:26')
---
    protected function createAsReferUserIfExists(Request $request, $user) {
        if($request->has('refer') && $request->refer != null && User::where('referral_id',trim($request->refer))->exists()) {
            $refer_user = User::where('referral_id',trim($request->refer))->first();

            $refer_user_id = $refer_user->id; // who refer this new user
            try{
                ReferredUser::create([
                    'refer_user_id'     => $refer_user_id,
                    'new_user_id'       => $user->id,
                    'created_at'        => now(),
                ]);

select * from `referral_settings` limit 1
select * from `user_wallets` where `user_wallets`.`user_id` = 3 and `user_wallets`.`user_id` is not null and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `code` = 'USD') limit 1
insert into `transactions` (`type`, `trx_id`, `user_type`, `user_id`, `user_wallet_id`, `request_amount`, `request_currency`, `payable`, `receive_amount`, `receiver_type`, `receiver_id`, `available_balance`, `status`, `created_at`) values ('REFER-BONUS', 'AxXF5pieVpOBbAG3', 'ADMIN', 1, 7, '10.00000000', 'USD', '10.00000000', '10.00000000', 'USER', 3, 60, 1, '2023-12-03 14:55:26')
update `user_wallets` set `balance` = `balance` + 10.00000000 where `id` = 7
---
    protected function createReferBonus($user) {
        $refer_level = ReferralSetting::first();
        $refer_user = $user;

        $system_super_admin = get_super_admin();
        $default_currency = CurrencyProvider::default();

        $refer_user_wallet = $refer_user->wallets()->whereHas('currency',function($query) use ($default_currency) {
            $query->where('code',$default_currency->code);
        })->first();

        DB::beginTransaction();
        try{
            DB::table('transactions')->insert([
                'type'              => PaymentGatewayConst::TYPEREFERBONUS,
                'trx_id'            => generate_unique_string('transactions','trx_id',16),
                'user_type'         => GlobalConst::ADMIN,
                'user_id'           => $system_super_admin->id,
                'user_wallet_id'    => $refer_user_wallet->id,
                'request_amount'    => $refer_level->bonus,
                'request_currency'  => $default_currency->code,
                'payable'           => $refer_level->bonus,
                'receive_amount'    => $refer_level->bonus,
                'receiver_type'     => GlobalConst::USER,
                'receiver_id'       => $refer_user->id,
                'available_balance' => $refer_user_wallet->balance + $refer_level->bonus,
                'status'            => PaymentGatewayConst::STATUSSUCCESS,
                'created_at'        => now(),
            ]);

            // Update user wallet balance
            DB::table($refer_user_wallet->getTable())->where('id',$refer_user_wallet->id)->increment('balance',$refer_level->bonus);

select * from `referral_settings` limit 1
select * from `user_wallets` where `user_wallets`.`user_id` = 11 and `user_wallets`.`user_id` is not null and exists (select * from `currencies` where `user_wallets`.`currency_id` = `currencies`.`id` and `code` = 'USD') limit 1
insert into `transactions` (`type`, `trx_id`, `user_type`, `user_id`, `user_wallet_id`, `request_amount`, `request_currency`, `payable`, `receive_amount`, `receiver_type`, `receiver_id`, `available_balance`, `payment_currency`, `remark`, `status`, `created_at`) values ('BONUS', 'dzgOKvoqzPQ1mpsk', 'ADMIN', 1, 31, '10.00000000', 'USD', 0, '10.00000000', 'USER', 11, 10, 'USD', 'Registration Bonus', 1, '2023-12-03 14:55:26')
---
    protected function createNewUserRegisterBonus($user) {
        $referral_settings = ReferralSetting::first();
        if($referral_settings && $referral_settings->status == GlobalConst::ACTIVE && $referral_settings->bonus > 0) {

            // need to add bonus in user wallet
            $default_currency = CurrencyProvider::default();
            $system_super_admin = get_super_admin();

            $user_wallet = $user->wallets()->whereHas('currency',function($query) use ($default_currency) {
                $query->where('code',$default_currency->code);
            })->first();

            // create bonus transaction
            DB::beginTransaction();
            try{
                DB::table('transactions')->insert([
                    'type'              => PaymentGatewayConst::TYPEBONUS,
                    'trx_id'            => generate_unique_string('transactions','trx_id',16),
                    'user_type'         => GlobalConst::ADMIN,
                    'user_id'           => $system_super_admin->id,
                    'user_wallet_id'    => $user_wallet->id,
                    'request_amount'    => $referral_settings->bonus,
                    'request_currency'  => $default_currency->code,
                    'payable'           => 0,
                    'receive_amount'    => $referral_settings->bonus,
                    'receiver_type'     => GlobalConst::USER,
                    'receiver_id'       => $user->id,
                    'available_balance' => $user_wallet->balance + $referral_settings->bonus,
                    'payment_currency'  => $default_currency->code,
                    'remark'            => Lang::get("Registration Bonus"),
                    'status'            => PaymentGatewayConst::STATUSSUCCESS,
                    'created_at'        => now(),
                ]);

update `user_wallets` set `profit_balance` = `profit_balance` + 10.00000000 where `id` = 31
---
                ];

                // Update user wallet balance
                DB::table($user_wallet->getTable())->where('id',$user_wallet->id)->increment($wallet_type[$referral_settings->wallet_type],$referral_settings->bonus);