app/Models/Agent.php

    public function getLastLoginAttribute() {
        if($this->loginLogs()->count() > 0) {
---
select count(*) as aggregate from `agent_login_logs` where `agent_login_logs`.`agent_id` = 1 and `agent_login_logs`.`agent_id` is not null