app/Http/Controllers/Admin/SetupSectionsController.php

    public function __construct()
    {
        $this->languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->get();
---
select * from `languages` where not `code` = 'en'

    public function promotionalBannerItemStore(Request $request,$slug) {
        $basic_field_name   = [
            'button_name'       => "required|string|max:255",
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"promotional-banner-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug    = Str::slug(SiteSectionConst::PROMOTIONAL_BANNER);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'promotional-banner' limit 1

        $update_data['key']     = $slug;
        $update_data['value']   = $section_data;
        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where (`key` = 'promotional-banner') limit 1

    public function promotionalBannerStatusUpdate(Request $request,$slug) {

        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);

        if ($validator->stopOnFirstFailure()->fails()) {
            return Response::error($validator->errors()->all(),null,400);
        }

        $slug           = Str::slug(SiteSectionConst::PROMOTIONAL_BANNER);
        $section        = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'promotional-banner' limit 1

    public function languages() {
        $languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->select("code","name")->get()->toArray();
---
select `code`, `name` from `languages` where not `code` = 'en'